/*输入:一行，三个自然数N，i，j，相邻两个数之间用单个空格隔开。1 <= N <= 10。
输出,四行：
第一行：从左到右输出同一行格子位置；
第二行：从上到下输出同一列格子位置；
第三行：从左上到右下输出同一对角线格子位置；
第四行：从左下到右上输出同一对角线格子位置。

其中每个格子位置用如下格式输出：(x,y)，x为行号，y为列号，采用英文标点，中间无空格。
相邻两个格子位置之间用单个空格隔开。
样例输入
4 2 3
样例输出
(2,1) (2,2) (2,3) (2,4)//同一行上 
(1,3) (2,3) (3,3) (4,3)//同一列上 
(1,2) (2,3) (3,4)//从左上到右下 
(4,1) (3,2) (2,3) (1,4)//从左下到右上*/
#include<iostream>
#include<cstdio>
using namespace std;
int main ()
{
	int n,i,j;//n表示n阶矩阵，i,j表示第i行第j列
	cin>>n>>i>>j;
	int k;
	
	//输出同行
	for(k=1;k<=n;k++)
		printf("(%d,%d) ",i,k);
    printf("\n");
    
    //输出同列
	for(k=1;k<=n;k++)
	    printf("(%d,%d) ",k,j); 
	printf("\n");
	
	//输出从左上到右下的对角
	for(k=1;k<=n;k++)
	{
		if(k+j-i>=1&&k+j-i<=n)
		printf("(%d,%d) ",k,k+j-i);
	} 
	printf("\n");
	
	//输出从左下到右上
	for(k=n;k>=1;k--)
	{
		if(i+j-k>=1&&i+j-k<=n)
		printf("(%d,%d) ",k,i+j-k);
	} 
	printf("\n");
	return 0;
} 
 
