/*描述
输入一个n行m列的黑白图像，将它顺时针旋转90度后输出。
输入
第一行包含两个整数n和m，表示图像包含像素点的行数和列数。1 <= n <= 100，1 <= m <= 100。
接下来n行，每行m个整数，表示图像的每个像素点灰度。相邻两个整数之间用单个空格隔开，每个元素均在0~255之间。
输出
m行，每行n个整数，为顺时针旋转90度后的图像。相邻两个整数之间用单个空格隔开。
样例输入
3 3
1 2 3
4 5 6
7 8 9
样例输出
7 4 1
8 5 2
9 6 3*/
//矩阵旋转 
#include<iostream> 
#include<cstdio>
using namespace std;
int main ()
{
	int a[105][105];
	int n,m;
	scanf("%d %d",&n,&m);
	int i,j;
	//输入矩阵 
	for(i=1;i<=n;i++)
	{
		for(j=1;j<=m;j++)
		{
			scanf("%d",&a[i][j]);
		}
	}
	 
	for(j=1;j<=m;j++)//旋转90度后，行变成了列，列变成了行 11 12 13    31 21 11
	{                                                  // 21 22 23 ==>32 22 12
		for(i=n;i>=1;i--)                              // 31 32 33    33 32 31
		{
			printf("%d ",a[i][j]);
		}
		printf("\n");
	}  
	return 0;
} 
