/*描述
任意给定一个正整数N(N<=100)，计算2的n次方的值。
输入
输入一个正整数N。
输出
输出2的N次方的值。*/
//思路:假设输入数字为5
/*外层循环5次
外层第一次==>a[49]=2,a[48],a[47].......=0,b一直为0
外层第二次==>a[49]=4,a[48],a[47].......=0,b一直为0
外层第三次==>a[49]=8,a[48],a[47].......=0,b一直为0
外层第四次==>a[49]=6(8*2=16,16%10=6) b=1;a[48]=1(0*2+1=1,1%10=1) b=0;a[47].......=0,b=1
外层第五次==>a[49]=2(6*2=12,12%10=2) b=1;a[48]=3(1*2+1=3,3%10=3) b=0;a[47].......=0,flag=0*/
 
#include<stdio.h> 
int main()
{	
	int a[50]={0};//估计50个位数保存应该够用了 
	a[49]=1;/*用数组存储，从右往左依次敬位*/ 
	int n,i,b=0;//这个b充当敬位的功能,相当于满十敬一 
	scanf("%d",&n);
	//n次循环。就是乘了n次 
	while(n--)
	{
		int i=49;
		while(i>0)
		{
			int flag=2*a[i]+b;
			a[i]=flag%10;
			b=flag/10;
			i--;
		}
	}
	//去除前导零 
	int flag=0;
	for(i=0;i<50;i++)
	{ 
		if(a[i]!=0) 
		{
			flag=i;
		     break;
	    }
	}
	for(i=flag;i<50;i++)
		printf("%d",a[i]);
	return 0;
 } 

